{
  "20183000": {
    "start_date": "Oct 2018",
    "end_date": "present",
    "title": "Systems Programmer",
    "employer": "Department of Defense (Parsons)",
    "blurb": "Wrote security compliance modules for the DoD High Performance Computer Modernization Program. Developed architecture, testing, and coding documents for 200K SLOC of organically developed Perl. Automated several steps in the build process and grew the test suite by a factor of ten. Introduced peer code review, frequent testing, shorter sprints, and version control branching to the team development process. Resolved issues with third-party undocumented API changes.",
    "tech": "Perl, STIGs, Git, TDD",
    "extra": null
  },
  "20162018": {
    "start_date": "Jul 2016",
    "end_date": "Oct 2018",
    "title": "Senior DevOps Engineer",
    "employer": "Department of Defense (Parsons)",
    "blurb": "Automated the patching process and the post-patch operating system health checks. Used Kickstart and Ansible to turn a multi-week per node build process into a half day task for multiple nodes. Provided user documentation for remote site customers. Trained staff, gave briefings, and wrote technical plans for business development efforts.",
    "tech": "Red Hat Enterprise Linux, Ansible, Python, Ruby, Git, STIGs",
    "extra": null
  },
  "20132016": {
    "start_date": "Apr 2013",
    "end_date": "Jul 2016",
    "title": "Senior DevOps Engineer",
    "employer": "Department of Defense (APEX)",
    "blurb": "Completed a six month stalled Industrial Control Systems project in one week. Trained staff on new coding languages, process automation, and version control. Worked with security teams to quickly identify and resolve numerous auditable findings.",
    "tech": "Red Hat Enterprise Linux, Industrial Control Systems, Solaris, Puppet, Ruby, Git, STIGs",
    "extra": null
  },
  "20122013": {
    "start_date": "Aug 2012",
    "end_date": "Feb 2013",
    "title": "DevOps Engineer (email)",
    "employer": "Rackspace",
    "blurb": "Restarted a stalled but critical deployment roll to 600+ pairs of servers. Worked closely with development teams and business leaders to ensure code drops were deployed successfully to 1200 servers. Wrote technical documentation and project plans.",
    "tech": "Red Hat Enterprise Linux, Chef, Git, MySQL, DRBD",
    "extra": null
  },
  "20092012": {
    "start_date": "Apr 2009",
    "end_date": "Aug 2012",
    "title": "DevOps Team Lead",
    "employer": "Department of Defense (Smartronix)",
    "blurb": "Led a four person team that supported a 1:45 admin to server ratio, met stringent security requirements, tripled server count during staff reductions. Served as a Task Force Leader during three full data center outages. Identified and resolved backup gaps. Wrote data collection and presentation programs. Wrote technical procedures and policy documentation based on Statement of Work and customer requests. Provided business case and initial leadership for a cross-function team that eliminated hundreds of long standing security vulnerabilities.",
    "tech": "Red Hat Enterprise Linux, Solaris, HP/UX, EMC Powerpath, HP hardware (PA-RISC, Itanium), Dell hardware, Oracle 10 RAC, Apache, Tomcat, Oracle Application Server, COTS, STIGs",
    "extra": null
  },
  "20102012": {
    "start_date": "May 2010",
    "end_date": "Aug 2012",
    "title": "Project Manager/Network Engineer",
    "employer": "Department of Defense (Smartronix)",
    "blurb": "Led the five person team that supported Cisco networking devices including IOS upgrades, enterprise reconfiguration, and documentation. Experienced a 50% increase in network devices, removed over one half mile of unused cable and hundreds of defunct network drops, and brought a completely unsupported network infrastructure into enterprise compliance. Worked with Global WAN teams to resolve issues. Enabled enterprise wide network device monitoring. Wrote, tested, trained, and utilized bare metal switch recovery. Wrote and Implemented VLAN scheme to prepare for massive server growth. Commended by higher headquarters auditing staff on network security posture and documentation. Provided business case and garnered customer support for a data center network upgrade.",
    "tech": "Cisco IOS, STIGs",
    "extra": null
  },
  "20082018": {
    "start_date": "Sep 2008",
    "end_date": "Oct 2018",
    "title": "Senior Systems Engineer",
    "employer": "Independent Contractor",
    "blurb": "Supported OS testing teams and client projects. Patched servers, automated processes, wrote standards, and trained System Admins. Provided written evaluations of vendor software and performed Security tool testing.",
    "tech": "Red Hat Enterprise Linux,  Solaris, Fedora, Oracle Linux, SUSE Enterprise Linux",
    "extra": null
  },
  "20052008": {
    "start_date": "Dec 2005",
    "end_date": "Aug 2008",
    "title": "DevOps Engineer",
    "employer": "Wachovia Bank",
    "blurb": "Developed interdisciplinary customer feedback loop for the Distributed Systems Engineering team. Automated processes, wrote standards, and trained incoming engineers. Provided on-call centralized security application support for 3,000+ servers.",
    "tech": "Red Hat Enterprise Linux, Solaris, HP/UX, SuSE Linux Enterprise Server, HP hardware (PA-RISC, Itanium), Dell hardware",
    "extra": null
  },
  "20052005": {
    "start_date": "May 2005",
    "end_date": "Dec 2005",
    "title": "Systems Engineer",
    "employer": "Bank of America (Apex Systems)",
    "blurb": "Automated processes, wrote standards, and trained incoming engineers in a large scale data center. Patched servers, replaced failed hardware, and maintained systems in production state.",
    "tech": "Red Hat Enterprise Linux, Solaris, HP/UX, EMC Powerpath, IBM Blade Chassis, Fujitsu Primepower, Sun mid-range, IBM Power servers, HP, Dell",
    "extra": null
  },
  "20042005": {
    "start_date": "Sep 2004",
    "end_date": "May 2005",
    "title": "Senior Unix Engineer",
    "employer": "Transamerica Reinsurance  Inc. (Contractor)",
    "blurb": "Automated Solaris (Jumpstart) and Red Hat (Kickstart) build procedures. Worked with Development team to support application configurations.",
    "tech": "Solaris, Red Hat Enterprise Linux, Oracle, Veritas Volume Manager/Filesystem,  Sendmail, Apache, Tomcat",
    "extra": null
  },
  "20012004": {
    "start_date": "Jan 2001",
    "end_date": "Sep 2004",
    "title": "Senior Unix Engineer",
    "employer": "Wall Street Journal/Dow Jones  Inc.",
    "blurb": "Saved ~$200,000 by writing custom software to increase availability. Analyzed life-cycle server configurations to save $120,000 in annual license costs. Automated server builds. Reduced n-tiered 30 minute SLAs to a 3 minute response time with direct hand-off, 24x7x365.25.",
    "tech": "Solaris, Red Hat Enterprise Linux, Sun Cluster, Legato backup, Oracle, Vignette Story Server, Veritas Volume Manager/Filesystem, Sendmail, Apache, Tomcat",
    "extra": null
  },
  "20002000": {
    "start_date": "May 2000",
    "end_date": "Dec 2000",
    "title": "Senior Unix Engineer",
    "employer": "Rosenbluth International",
    "blurb": "Worked with developers to standardize deployment processes for application software.",
    "tech": "Solaris, Red Hat Enterprise Linux, Legato backup, Oracle, Veritas Volume Manager/Filesystem, Sendmail, Apache, Tomcat",
    "extra": null
  },
  "19992000": {
    "start_date": "1999",
    "end_date": "2000",
    "title": "Team Lead (Software Deployment)",
    "employer": "Bell Atlantic/Verizon (TekSystems  Inc.)",
    "blurb": "Team Lead in the Bell Atlantic Distributed Software Operations-Software Deployment group. Responsible for deploying over 70 application packages and software/OS upgrades to more than 1100 production Unix (Solaris, HP-UX) servers in the North-Eastern US region. Wrote shell scripts, performed remote software deployments, supervised six deployment specialists, trouble-shoot server and package errors, coordinated 150+ item change control procedures. Built a certification resource web site, trained new hires, wrote a Tk based graphical interface to unify existing scripts, taught basic HTML, introduced software version control, and improved the workload assignment process.",
    "tech": "Solaris, HP/UX",
    "extra": null
  },
  "19981999": {
    "start_date": "1998",
    "end_date": "1999",
    "title": "Senior Unix Administrator",
    "employer": "Wall Street Journal/Dow Jones Inc. (TekSystems  Inc.)",
    "blurb": "Saved over $75,000 in new-hire costs by analyzing, communicating, and tracking required production support skills on limited use software. Level 2 support for print Journal. Documented procedures for Help Desk staff.",
    "tech": "Solaris, Legato backup, Veritas Volume Manager/Filesystem",
    "extra": null
  },
  "19981998": {
    "start_date": "1998",
    "end_date": "1998",
    "title": "Unix Engineer",
    "employer": "Independent Contractor",
    "blurb": "Documented improved server configurations to fix backup issues. Configured Apache.",
    "tech": "Red Hat Linux, SCO Unix, Sendmail, Apache, Tomcat",
    "extra": null
  },
  "19971998": {
    "start_date": "1997",
    "end_date": "1998",
    "title": "Linux Admin",
    "employer": "Spidernet s.r.l  Repubblica Italiana",
    "blurb": "Supported Linux and Solaris in a multi-lingual environment. Took ownership of OS and hardware production issues and channeled application issues to specialists.",
    "tech": "Solaris, Red Hat Linux, Sendmail, Apache, Tomcat",
    "extra": null
  },
  "19941995": {
    "start_date": "1994",
    "end_date": "1995",
    "title": "Director of Operations",
    "employer": "City of Glenarden  MD",
    "blurb": "Served as Acting City Manager. Supervised 5 direct reports and 32 total staff.",
    "tech": null,
    "extra": null
  },
  "19901994": {
    "start_date": "1990",
    "end_date": "1994",
    "title": "Small Business Manager",
    "employer": "Entrepreneur",
    "blurb": "Business saw a 700% customer increase in 13 months. Added revenue streams for related products without requiring large inventory loads.",
    "tech": null,
    "extra": null
  },
  "19881992": {
    "start_date": "1988",
    "end_date": "1992",
    "title": "Operations Section Manager",
    "employer": "U.S. Air Force",
    "blurb": "Training supervisor for Southern Command Air Force Disaster Response teams, first-responder to critical incidents.",
    "tech": null,
    "extra": null
  },
  "19821988": {
    "start_date": "1982",
    "end_date": "1988",
    "title": "Teletype Maintenance Technician",
    "employer": "U.S. Air Force",
    "blurb": "Supported secure digital communications equipment in the U.S. and U.K.",
    "tech": null,
    "extra": null
  }
}
